alice_in_wonderland = ('"Would you tell me, please, which way I ought to go from here?"\n'
                       ' "That depends a good deal on where you want to get to," said the Cat.\n' 
                       ' "I don\'t much care where ——" said Alice. \n' 
                       ' "Then it does\'t matter which way you go," said the Cat. \n' 
                       ' "—— so long as I get somewhere," Alice added as an explanation. \n'
                       ' "Oh, you\'re sure to do that," said the Cat, "if you only walk long enough."\n')  
# task 01 == Розділіть змінну alice_in_wonderland так, щоб вона займала декілька фізичних лінії
# task 02 == Знайдіть та відобразіть всі символи одинарної лапки (') у тексті
# task 03 == Виведіть змінну alice_in_wonderland на друк

print(alice_in_wonderland)

"""
    # Задачі 04 -10:
    # Переведіть задачі з книги "Математика, 5 клас"
    # на мову пітон і виведіть відповідь, так, щоб було
    # зрозуміло дитині, що навчається в п'ятому класі
"""
# task 04
"""
Площа Чорного моря становить 436 402 км2, а площа Азовського
моря становить 37 800 км2. Яку площу займають Чорне та Азов-
ське моря разом?
"""
black_sea = 436402
azov_sea = 37800
total_sea = 436402 + 37800 
print (f'Чорне та Азовське моря разом займають {total_sea} км2')

# task 05
"""
Мережа супермаркетів має 3 склади, де всього розміщено
375 291 товар. На першому та другому складах перебуває
250 449 товарів. На другому та третьому – 222 950 товарів.
Знайдіть кількість товарів, що розміщені на кожному складі.
"""
storage_total = 375291
storage_1_n_2 = 250449
storage_2_n_3 = 222950
storage_1 = storage_total - storage_2_n_3
storage_3 = storage_total - storage_1_n_2
storage_2 = storage_total - storage_1 - storage_3
print (f'Кількість товару розміщеного на складу 1 - {storage_1},складі 2 - {storage_2}, складі 3 - {storage_3}')


# task 06
"""
Михайло разом з батьками вирішили купити комп’ютер, ско-
риставшись послугою «Оплата частинами». Відомо, що сплачу-
вати необхідно буде півтора року по 1179 грн/місяць. Обчисліть
вартість комп’ютера.
"""
total_comp_price = 1179 * 18
print(f'Вартість комп\'ютера - {total_comp_price} грн')

# task 07
"""
Знайди остачу від діленя чисел:
a) 8019 : 8     d) 7248 : 6
b) 9907 : 9     e) 7128 : 5
c) 2789 : 5     f) 19224 : 9
"""
value_a = 8019 % 8
value_b = 9907 % 9
value_c = 2789 % 5
value_d = 7248 % 6
value_e = 7128 % 5
value_f = 19224 % 9
print(f'Остача з ділення a = {value_a}, b = {value_b}, c = {value_c}, d = {value_d}, e = {value_e}, f = {value_f}')

# task 08
"""
Іринка, готуючись до свого дня народження, склала список того,
що їй потрібно замовити. Обчисліть, скільки грошей знадобиться
для даного її замовлення.
Назва товару    Кількість   Ціна
Піца велика     4           274 грн
Піца середня    2           218 грн
Сік             4           35 грн
Торт            1           350 грн
Вода            3           21 грн
"""
pizza_total = (274 * 4) + (218 * 2)
juice_total = 35 * 4 
cake_total = 350
water_total = 21 * 3
order_total = pizza_total + juice_total + cake_total + water_total
print(f' Для замовлення потрібно {order_total} грн')

# task 09
"""
Ігор займається фотографією. Він вирішив зібрати всі свої 232
фотографії та вклеїти в альбом. На одній сторінці може бути
розміщено щонайбільше 8 фото. Скільки сторінок знадобиться
Ігорю, щоб вклеїти всі фото?
"""
igor_pages = 232 // 8
print(f' Ігорю знадобиться {igor_pages} сторінок')


# task 10
"""
Родина зібралася в автомобільну подорож із Харкова в Буда-
пешт. Відстань між цими містами становить 1600 км. Відомо,
що на кожні 100 км необхідно 9 літрів бензину. Місткість баку
становить 48 літрів.
1) Скільки літрів бензину знадобиться для такої подорожі?
2) Скільки щонайменше разів родині необхідно заїхати на зап-
равку під час цієї подорожі, кожного разу заправляючи пов-
ний бак?
"""
petrol_total_need = 16 * 9 
petrol_station_visits = petrol_total_need // 48 
print(f'Потрібно {petrol_total_need} літрів бензину, потрібно {petrol_station_visits} разів заїхати на заправку') 
